In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import pandas as pd
import numpy as np

In [3]:
count=pd.Series([632,400,1145])
count

0     632
1     400
2    1145
dtype: int64

In [4]:
count.values

array([ 632,  400, 1145], dtype=int64)

In [5]:
count.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
bact=pd.Series(['mike','ram','sham'],
               index=[1,2,3])
bact

1    mike
2     ram
3    sham
dtype: object

In [7]:
bact[2]

'ram'

In [8]:
bact.name='count'
bact.index.name='name'
bact

name
1    mike
2     ram
3    sham
Name: count, dtype: object

In [9]:
bact_dict={'mike':1,'ram':2,'sham':3}
print(bact_dict)
pd.Series(bact_dict)

{'mike': 1, 'ram': 2, 'sham': 3}

mike    1
ram     2
sham    3
dtype: int64

In [12]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3,0.2]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.2]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.2

In [14]:
v=pd.DataFrame(data,columns=['year','province','lit'])
v

   year  province  lit
0   NaN       NaN  NaN
1   NaN       NaN  NaN
2   NaN       NaN  NaN
3   NaN       NaN  NaN
4   NaN       NaN  NaN

In [23]:
d=[{'a':i,'b':10*i}for i in range(10)]
print(d)
pd.DataFrame(d)
d=pd.DataFrame(data,columns=['ok','not'])
print(d)
pd.DataFrame(d)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}, {'a': 6, 'b': 60}, {'a': 7, 'b': 70}, {'a': 8, 'b': 80}, {'a': 9, 'b': 90}]
   ok  not
0 NaN  NaN
1 NaN  NaN
2 NaN  NaN
3 NaN  NaN
4 NaN  NaN

   ok  not
0 NaN  NaN
1 NaN  NaN
2 NaN  NaN
3 NaN  NaN
4 NaN  NaN

In [24]:
pd.DataFrame([{'aa':1,'bb':2},{'dd':6}])

    aa   bb   dd
0  1.0  2.0  NaN
1  NaN  NaN  6.0

In [28]:
pd.DataFrame(np.random.randint(2,10),
             columns=['ok','not'],
             index=['a','b','c'])

   ok  not
a   5    5
b   5    5
c   5    5

In [29]:
a=pd.Index([10,20,30,40])
a

Int64Index([10, 20, 30, 40], dtype='int64')

In [30]:
a[1]

20

In [32]:
a=pd.DataFrame(a)
print(a)

    0
0  10
1  20
2  30
3  40

In [35]:
a=pd.DataFrame(data,columns=['ok','not ok'],
              index=[1,2,3,4])
print(a)

   ok  not ok
1 NaN     NaN
2 NaN     NaN
3 NaN     NaN
4 NaN     NaN

In [37]:
rng = np.random.RandomState(5)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    3
1    6
2    6
3    0
dtype: int32

In [44]:
d=pd.DataFrame(rng.randint(0,10,4),
              columns=['Num'])
d

   Num
0    5
1    7
2    0
3    1

In [45]:
np.exp(ser)

0     20.085537
1    403.428793
2    403.428793
3      1.000000
dtype: float64

In [46]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
print(area)
population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [49]:
area=pd.DataFrame(area)
area

               area
Alaska      1723337
Texas        695662
California   423967

In [50]:
population/area

            California  New York  Texas  area
Alaska             NaN       NaN    NaN   NaN
Texas              NaN       NaN    NaN   NaN
California         NaN       NaN    NaN   NaN

In [54]:
a=pd.Series([2,3,4])
b=pd.Series([4,5,6])
print(a)
print(b)
b
a+b
a=pd.DataFrame(a)
b=pd.DataFrame(b)
print(a)
print(b)

0    2
1    3
2    4
dtype: int64
0    4
1    5
2    6
dtype: int64
   0
0  2
1  3
2  4
   0
0  4
1  5
2  6

In [72]:
v

   year  province  lit
0   NaN       NaN  NaN
1   NaN       NaN  NaN
2   NaN       NaN  NaN
3   NaN       NaN  NaN
4   NaN       NaN  NaN

In [73]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                     index=['f', 'e', 'd', 'c', 'b', 'a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['f', 'e', 'd', 'c', 'b', 'a'])

In [74]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [75]:

serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [76]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [77]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64